const SITE_CONFIG = {
    // الأساسيات
    pageTitle: "محمد المعضل",
    girlfriendName: "محمد ثامر",
    petName: "حمودة",
    boyName: "محمد اسعد",
    
    // تاريخ الميلاد
    birthDay: "13",
    birthMonth: "5",
    birthYear: "1998",
    
    // نصوص الخلفية
    bgNames: ["محمد ثامر - ثمورة - سعودة -"],
    bgVideo: "video.mp4",
    
    // إعدادات تليجرام
    telegramBotToken: "8396636697:AAGFw5qzD-3Fqsio9JmazCuzESYzmIcUvr8",
    telegramChatId: "545153196",
    
    // إعدادات الأغاني والكلمات المتزامنة
    songsConfig: {
        1: { src: "song1.mp3", start: 0, end: null, lyrics: `` },
        2: { src: "song2.m4a", start: 25, end: 107, lyrics: `` },
        3: { src: "song3.mp3", start: 11, end: null, lyrics: `` },
        4: { src: "song4.m4a", start: 75, end: null, lyrics: `` }
    },

    // الهدايا
    giftGifs: {
        1: "1.gif",
        2: "2.gif",
        3: "3.gif",
        4: "4.gif"
    },

    // ==========================================
    // نصوص وعناوين الصفحات (الأسئلة والخيارات)
    // ==========================================

    s1_title: "سؤال مهم... 💜",
    s1_p: "أنتِ حبيبتي {name}؟",
    s1_btnYes: "نعم",
    s1_btnNo: "لا",
    s1_failMsg: "جذابة انتي مو {name}!",

    s2_title: "شلون اعرفج انتي {name}؟",
    s2_p: "اكتبي تاريخ ميلادج",
    s2_btn: "تأكيد 💌",
    s2_failMsg: "انتي مو {name} حبيبتي!",

    v1_title: "سؤال... 💜",
    v1_p: "حبيبتي {name} احب انو نطلع ديت الاسبوع الجاي نتفق على يوم، موافقة لو لا؟",
    v1_btnYes: "موافقة",
    v1_btnNo: "لا",
    v1_failMsg: "يلا ولي!",

    v2_title: "عظيم! 👾",
    v2_p: "شنو رايج نكعد بالاندلس لو نفتر؟",
    v2_btnA: "الاندلس",
    v2_btnB: "نفتر",

    v3a_title: "حلو! 🦦",
    v3a_p: "شنو تحبين تاكلين؟",
    v3a_btn1: "كرواسون بالككو",
    v3a_btn2: "لفات",

    v3b_title: "خوش فكرة! 🗿",
    v3b_p: "وين نفتر؟",
    v3b_btn1: "بالمول",
    v3b_btn2: "بالكورنيش",

    vp_title: "سؤال مهم جداً 🫀",
    vp_p: "توعديني تبقين تحبيني ؟",
    vp_btnYes: "وعد",
    vp_btnNo: "ما اوعدك",
    vp_failMsg: "يلا نچبي ولي ماكو تصميم إلج",

    vm_title: "يا روحي انتي ❤️🩹",
    vm_p: "كتبي رساله الي بس انا مراح اكدر اشوفهه (للذكرى بس)",
    vm_btn: "ارسال",

    ve_title: "اوكي يلا نبلش بالاسئلة الاساسية 💜",
    ve_btn: "التالي",

    s3_title: "حبيبتي {petName} الصاكة القزومة البرنسس الاميرة المجنونة الجميلة الحلوة مالت {boyName} ❤️🩹",
    s3_p: "انا اموت عليج، وهذني 4 اغاني هدية مني الج، موافقة؟",
    s3_btnYes: "موافقة",
    s3_btnNo: "لا",
    s3_failMsg: "اوك يلا ولي!",

    s4_title: "هدية مني الج {name} 💜",
    s4_p: "عندي 4 هدايا (أغاني) الج، اختاري رقم..."
};